Week2_l/f1.tex
% Created 2022-05-02 Mon 11:57
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Kristoffer Kortbaek}
\date{\today}
\title{F1}
\hypersetup{
 pdfauthor={Kristoffer Kortbaek},
 pdftitle={F1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.0.50 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Platon}
\label{sec:org78b1cce}
\begin{itemize}
\item Ideernes verden
\item Den virkelige verden?
\begin{itemize}
\item Den dårlige version af ideernes verden vi kan sanse os til
\item Skyggebilleder af ideernes verden
\end{itemize}
\end{itemize}

Matematik hører til i ideernes verden.
\begin{itemize}
\item Tal, formler\ldots{} er en del af ideernes verden vi har adgang til
\item Ideen kvadrat er fra ideernes verden, det vi har adgang til er skyggebillede af ideernes verden
\end{itemize}

Formalvidenskab - vi har lagt alle reglerne(Helge Kragh)
\begin{itemize}
\item Lidt ligesom ideernes verden
\end{itemize}

\section{Wigners mirakler}
\label{sec:org493764e}
Hvis matematikken lever i ideernes verden, hvordan kan den bruges til at beskrive naturvidenskab?
\begin{itemize}
\item Matematiske idder er noget vi har skabt helt frit, uden at tage hensyn til
mennesket kultur(social konstruktivisme)
\item Dualisme mellem det ideal og real
\end{itemize}

Hvordan forklarer vi hvordan matematik kan anvendes?
\begin{itemize}
\item Matematisk erkendelse udvikler sig sammen med naturvidenskabelig erkendelse
\item Vi fokuserer der hvor vi kan bruge det til noget
\end{itemize}
\section{Kant}
\label{sec:orgbe55487}
a priori og a posteriori
A posterori
\begin{itemize}
\item Går ud i verden og stille spørgsmål
\end{itemize}

Analytisk udsagn
\begin{itemize}
\item Alle unkale er ugidt
\item Hvilken betydning er indlejret i hinanden
\item Ren tautologi
\end{itemize}
Syntatiske er alle de andre

Kant siger matematik er syntetisk a priori
\begin{itemize}
\item Matematik handler om hvoran mennesker er i verden?
\end{itemize}

\section{Metamatematik}
\label{sec:org9fe5018}
Hilbert
\begin{itemize}
\item 1900-tallet bliver matematisk genstandsfelt for matematik
\item Matematik bliver brugt til at studerer matematik
\item Matematisk object er kun det vi har defineret til hvad der
\item Det er ligegyldigt hvad matematik studerer - det har vi selv valgt
\item Metamisk teori om matematisk aktionssystmer -> bevisteori
\item Hvorfor har helge kragh ikke ret?
\item Aktionssystemet bliver udvikler
\item Hilbert - finitistisk kerne
\end{itemize}

Kurt göbel
\begin{itemize}
\item Ufuldstændigshedssætning
\item Der findes altid noget matematik ikke kan nå endnu
\begin{itemize}
\item Så kan vi tilføje noget til matematik, men der er stadig ting der mangler
\end{itemize}
\end{itemize}

\section{Firefarvesætningen}
\label{sec:org79238c7}
\begin{itemize}
\item Graf problem
\item Løsningen består af at teste 1476 grafer på computeren
\begin{itemize}
\item Tager 1200 CPU timer
\item Dette er så lang tid baggrundsstråling kan flippe en bit så beviset falder fra hinanden
\item Virkeligheden ødelægger altså det matematisk perfekt
\end{itemize}
\item Hvert trin er større end mennesker
\item Matematisk problem der ikke kan løses uden computeren
\item Satte spørgsmål ved om computeren er ligesom en blyant
\item Modsætning til normale beviser, så består beviset af
\begin{itemize}
\item Kort stykke matematik
\item Computer program
\item Argument for korrekthed af computerprogram
\item Output af program
\item 150 siders bevis
\end{itemize}
\end{itemize}

\section{Kuhn}
\label{sec:org848a140}
Sociologisk historisk synspunkt.
Det en gruppe videnskabsmænd er fælles om er etparadigme.
Kunne være turingmaskinen og von-neumann arkitekturen

\begin{itemize}
\item Nogle elementer er vigtigere end andre
\begin{itemize}
\item Dette bestemmes af en socail afgrænsning
\end{itemize}
\item Sammenstiling af ting vi deler er et paradigme
\item Når et paradigme skfiter, så ændres verden også
\begin{itemize}
\item Vores syn på verden, ændre hvordan verden er
\item Verden er som den fremstår for os
\end{itemize}
\item Paradigme er instantieret i disciplinær matrix
\begin{itemize}
\item Metafysisk - specille måder at tænke om paradigmet ude fra. Analogier set udefra
\item symbolske generalisering
\item værdier - det der binder større videnskabeligt samfund sammen
\begin{itemize}
\item Hvor vigtigt er det teorien kan forklare noget
\item Det skal deles i paradigmet
\end{itemize}
\item Exsemplarer - vilke lærebøger, problemer, teknikker osv.
\item Symbolske generaliseringer - basale udsagn der ligner naturlove, men er definitioner
\begin{itemize}
\item Kunne være asymptotisk notation
\end{itemize}
\end{itemize}
\end{itemize}

Kuhn inkommensurabilitet(usammenlignelige)
\begin{itemize}
\item Eksperimenter er teori-afhængige
\item Paradigmer afløses af nye teorier
\item Når vi er indenfor et paradigme laver vi normalvidenskab - lære mere og mere
\item Derefter revolution
\item Hen over revolution er der inkommensurabilitet
\item Derefter nyt paradigme?
\end{itemize}
Kuhn revolution

Kuhn kan bruges til at indgrænse paradigme og vide hvornår der sker revolution

Paradigme er en måde at pakke alle antagelser væk som noget vi tror på eller
bare ved

\section{Transparadigmatiske værdier}
\label{sec:orge52a02d}
\begin{itemize}
\item Paradigmer som måske bliver videreført mellem to paradigmer
\item Bløder revolutionsideen op
\item Der er måske noget der er større end paradigmer
\item Paradigmer er som perler på en snor for Kuhn.
\item Vi bløder den op så perlerne hænge sammen og har noget til fælles - tykkere snor
\item To paradigmer sammen - overvej om der er noget mellem disciplinerne
\end{itemize}

\section{Hvad er paradigmer}
\label{sec:orgd237424}
\begin{itemize}
\item Paradigmer og disciplinære matricer kan bruges til at indfange en gruppe videnskabsfolker.
\item Paradigmet er en socilogisk process gennem disciplinering
\item Paradigmer skifter over tid men langsomt. Hold fast i grundprincipper indtil
skift/revolution. Derfor er der usammenlignelighed til stede
\end{itemize}
\end{document}
